Revit 2024 API
RebarBarType.StandardHookBendDiameter Property
 Defines hook bend diameter for rebar whose style is standard
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double StandardHookBendDiameter { get; set; }
Visual Basic
Public Property StandardHookBendDiameter As Double
	Get
	Set
Visual C++
public:
property double StandardHookBendDiameter {
	double get ();
	void set (double value);
}
Field Value
 The hook bend diameter for rebar whose style is standard
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: the bend diameter standardHookBendDiam isn't between bar diameter and 99.0
See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace